#+TITLE:Dice game 
#+AUTHOR: Peter van Huisstede
#+email: peter.vanhuisstede@eur.nl
#+INFOJS_OPT: 
-----

* Requirements

We are going to program a "game of dice". We start simple
with a function throw_die() that throws one die and we end up with a
complete game of "craps".

** Write throw_die()
Write a function throw-die() that returns a number from 1 to 6
inclusive.

#+NAME: throw_die1
#+BEGIN_SRC python :exports both :results output 
def throw_die():
    for i in [1, 2, 3, 4, 5, 6]:
        print(i)

throw_die()
#+END_SRC

#+RESULTS: throw-die
: 1
: 2
: 3
: 4
: 5
: 6

Well this brings us not far. What we need is a function that randomly
picks a number out of the range 1-6.

The following snippet directs us to the library random.

#+NAME: use_help
#+BEGIN_SRC python :exports both :results output
help("modules random")
#+END_SRC

Importing the library "random" first and then running the command
help(random) provides us with the necessary nformation to try someting
out: random.randint(1, 6) should do the trick of rollin a die.

#+NAME: throw_die2
#+BEGIN_SRC python :exports both :results output 
import random
def throw_die2():
    random.randint(1, 6)

throw_die2()
#+END_SRC

#+RESULTS: throw_die2

#+NAME: throw_dice
#+BEGIN_SRC python :exports both :results output 
import random
def throw_dice():
    throw = []
    throw.append(random.randint(1, 6))
    throw.append(random.randint(1, 6))
    return throw

print(throw_dice())
#+END_SRC

#+RESULTS: throw_dice
: [6, 1]

